** Endianness
   - x86-64 - "little endian" ⇒ in memory, data is stored with the least significant byte first
   - ths does not apply to the bits inside the bytes, or to registers - just memory
#+BEGIN_SRC asm :noweb yes :tangle endianness.asm
  <<functions>>
  global _start
  section .data
    foo: db 0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07, 0x08
    bar: db 0x0102030405060708
    baz: dq 0x0102030405060708
  section .text
  _start:
    mov rdi, [foo]
    call print_hex ; ⇒ 0807060504030201 - reverse order, because little endian
    call print_newline

    mov rdi, [bar]
    call print_hex ; ⇒ 0203040506070808 - only the last byte, 08, was taken because bar is 'db' - the rest come from foo
    call print_newline

    mov rdi, [baz]
    call print_hex ; ⇒ 0102030405060708 - all 8 bytes are stored, in the "correct" order because the whole value is stored as one
    call print_newline
    call exit_ok
#+END_SRC

#+RESULTS:
: 0807060504030201
: 0203040506070808
: 0102030405060708

** String length
#+BEGIN_SRC asm :noweb yes :tangle string-length-null.asm
  <<functions>>
  global _start
  section .data
    foo: db "foobar", 0
    bar: db "abc", 0
  section .text

  ; Calculate the length of a null-terminated string
  ; $1/rdi: pointer (address) to string start
  ; returns/rax: string length
  str_len:
    mov rsi, 0 ; init len 0
    .loop:
      mov dl, byte [rdi + rsi]
      cmp dl, 0
      je .end
      inc rsi
      jmp .loop
    .end:
      mov rax, rsi
      ret

  _start:
    ; calc foo's length
    mov rdi, foo
    call str_len
    mov rdi, rax
    call print_hex
    call print_newline

    ; calc bar's length
    mov rdi, bar
    call str_len
    mov rdi, rax
    call print_hex
    call print_newline

    ; exit
    call exit_ok
#+END_SRC

#+RESULTS:
: 0000000000000006
: 0000000000000003

** Function: print buffer as an unsigned 64-bit integer

#+BEGIN_SRC asm :noweb yes :tangle print-unsigned-number.asm
  <<functions>>
  global _start

  section .data

    foo: dq 0x64       ; 100
    bar: dq 0x100      ; 256
    baz: dq 0x12345678 ; 305,419,896
    max: dq 0xFFFFFFFF ; 4,294,967,295

  section .text

    ; Print the input buffer as a 64-bit unsigned int
    ; $1/rdi: pointer (address) to first byte
    print_uint:
      mov rcx, 10
      mov rax, [rdi]
      mov r8, 0      ; counts number of digits
      .loop:
        inc r8
        mov rdx, 0   ; used by div as the high word
        div rcx      ; division result ⇒ rax; remainder ⇒ rdx
        add rdx, 48  ; add 48 to get ascii code
        push rdx
        cmp rax, 0
        jne .loop

      mov rax, 1     ; syscall id
      mov rdx, 1     ; how many bytes to print - for syscall
      mov rdi, 1     ; stdout
      .print_loop:
        mov rsi, rsp   ; top of stack - ASCII code of decimal digit
        syscall
        pop r9
        dec r8
        cmp r8, 0
        jne .print_loop

      ret

    _start:
      ; print 100
      mov rdi, foo
      call print_uint
      call print_newline

      ; print 256
      mov rdi, bar
      call print_uint
      call print_newline

      ; print 305419896
      mov rdi, baz
      call print_uint
      call print_newline

      ; exit
      call exit_ok
#+END_SRC

#+RESULTS:
: 100
: 256
: 305419896

** Function: print buffer as a signed 64-bit integer

#+BEGIN_SRC asm :noweb yes :tangle print-signed-number.asm
  <<functions>>
  global _start

  section .data
    foo: dq 0xffffffffffffffff ; -1
    bar: dq 0xfffffffffffffffb ; -5
    baz: dq 0x5                ; +5

  section .text

  ; Print the input buffer as a 64-bit unsigned int
  ; $1/rdi: pointer (address) to first byte
  print_uint:
    mov rcx, 10
    mov rax, [rdi]
    mov r8, 0      ; counts number of digits
    .loop:
      inc r8
      mov rdx, 0   ; used by div as the high word
      div rcx      ; division result ⇒ rax; remainder ⇒ rdx
      add rdx, 48  ; add 48 to get ascii code
      push rdx
      cmp rax, 0
      jne .loop

    mov rax, 1     ; syscall id
    mov rdx, 1     ; how many bytes to print - for syscall
    mov rdi, 1     ; stdout
    .print_loop:
      mov rsi, rsp   ; top of stack - ASCII code of decimal digit
      syscall
      pop r9
      dec r8
      cmp r8, 0
      jne .print_loop

    ret

  ; Print the input buffer as a 64-bit signed int, represented as two's complement
  ; $1/rdi: pointer (address) to first byte
  print_int:

    ; get ascii for the sign (+: 43, -: 45)
    mov r9, [rdi]  ; copy the number
    sar r9, 63     ; shift 63 bits out
    cmp r9, 0      ; 0 - positive
    je .set_pos
    jne .set_neg

    ; if nr is negative, store ascii for minus in r8, and convert from two's complement in r9
    .set_neg:
      mov r8, 45     ; ascii for - (minus)

      ; get the unsigned value
      mov r9, [rdi]
      not r9         ; invert all bits
      add r9, 1      ; add 1
      jmp .print_sign

    ; if the value is positive, store ascii for '+' in r8 and simply copy the value to r9
    .set_pos:
      mov r8, 43     ; ascii for '+'
      mov r9, [rdi]

    ; print the sign
    .print_sign:
    mov rax, 1     ; syscall id
    mov rdx, 1     ; how many bytes to print - for syscall
    mov rdi, 1     ; stdout
    push r8        ; put r8 (the ascii of the sign) on the stack, so we get an address to give to 'write' syscall
    mov rsi, rsp   ; what to print - ascii of sign
    syscall
    pop r8

    ; use previously defined function to print r9
    push r9
    mov rdi, rsp
    call print_uint
    pop r9
    ret

    _start:
      ; print -1
      mov rdi, foo
      call print_int
      call print_newline

      ; print -5
      mov rdi, bar
      call print_int
      call print_newline

      ; print 5
      mov rdi, baz
      call print_int
      call print_newline

      ; exit
      call exit_ok
#+END_SRC

#+RESULTS:
: -1
: -5
: +5

** Function: read a character from stdin
   - read a char and return it in ~rax~
#+BEGIN_SRC asm :noweb yes :tangle read-char.asm
  <<functions>>
  global _start
  section .data
    prompt: db 'Enter a character: '
  section .text
  _start:
    mov rax, 1     ; syscall id = 1 (write)
    mov rdi, 1     ; syscall $1, fd = 1 (stdout)
    mov rsi, prompt; syscall $2, *buf = &prompt (addr from where to take bytes to be written)
    mov rdx, 19    ; syscall $3, count = 19 (how many bytes to write)
    syscall

    mov rax, 0     ; syscall id = 0 (read)
    mov rdi, 0     ; syscall $1, fd = 0 (stdin)
    push 0         ; zero out the top of the stack, where 
    mov rsi, rsp   ; syscall $2, *buf = rsp (addr where to put read byte)
    mov rdx, 1     ; syscall $3, count = 1 (how many bytes to read)
    syscall

    pop rax        ; return value

    call exit_ok   ; exit
#+END_SRC

#+RESULTS:
: Enter a character: 

